Конфигурация/Documents/СлужебноеРасследование.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>СлужебноеРасследование</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПолученияИнформации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Банк</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗаключенияДоговора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокДепозита</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСделки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСделки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСделок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Рынок</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РынкиЦенныхБумаг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦеннаяБумага</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумаги</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокРЕПО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыСлужебныхРасследований</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УсловияВозникновенияКонфликтаУстановлены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обоснование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПринятыеМеры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РуководительОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбстоятельствоВозникновенияКонфликтаИнтересов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбстоятельстваВозникновенияКонфликтаИнтересов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПравоНеПредотвращатьВозникновениеКонфликта</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриказОбОтказеОтПредотвращенияКонфликта</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВнутреннийДокумент</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРассмотрения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРаскрытияИнформации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособРаскрытияИнформации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПрекращенияКонфликта</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбстоятельстваПрекращенияКонфликта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричиныОтказаОтПредотвращенияКонфликта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>УсловияВозниковенияКонфликта</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОписаниеУсловий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЦенныеБумаги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Счет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
								<v8:Type>cfg:CatalogRef.ИсточникиСведенийПредоставляемыхЮрФизЛицами</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидСвязи</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыСвязейИсточниковСведенийПредоставляемыхЮрФизЛицами</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Рынок</Name>
							<Type>
								<v8:Type>cfg:EnumRef.РынкиЦенныхБумаг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦеннаяБумага</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумаги</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиКоличество</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИнформацияОКонфликте</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПредметКонфликта</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.СделкаРЕПО</v8:Type>
								<v8:Type>cfg:DocumentRef.МНО</v8:Type>
								<v8:Type>cfg:CatalogRef.ДоговорыБрокерскогоОбслуживания</v8:Type>
								<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
								<v8:Type>cfg:DocumentRef.Сделка</v8:Type>
								<v8:Type>cfg:CatalogRef.ДепозитныеВклады</v8:Type>
								<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
								<v8:Type>cfg:DocumentRef.СведенияПредоставляемыеЮрФизЛицами</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидСвязи</Name>
							<Comment>Заполняется для конфликтов в рамках кодекса профессиональной этике</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыСвязейИсточниковСведенийПредоставляемыхЮрФизЛицами</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/InformationRegisters/РеквизитыЮридическихЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>РеквизитыЮридическихЛиц</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КраткоеНаименованиеПоУставу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПолноеНаименованиеПоУставу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СокращенноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КПП2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОрганизационноПравоваяФорма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОрганизационноПравовыеФормы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодПоОКВЭД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>350</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодПоОКПО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодПоОКТМО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодПоОКАТО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОГРН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыдачиОГРН</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОрганВыдавшийОГРН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РезидентРФ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>TIN</Name>
					<Comment>Taxpayer Identification Number</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтранаРегистрации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидРегистрационногоДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДокументовЮридическихЛиц</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отрасль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Отрасли</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МеждународнаяКомпания</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособСозданияМеждународнойКомпании</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыСозданияМеждународнойКомпании</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Язык</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Языки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЮрФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/КурсыВалют.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>КурсыВалют</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Кратность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Documents/СлужебноеРасследование/Ext/ManagerModule.bsl
Функция ПолучитьМассивОтчетовДляПечати(Ссылка) Экспорт

	МассивОтчетов = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	#Область ТекстЗапроса
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СлужебноеРасследование.Ссылка КАК Ссылка,
		|	НАЧАЛОПЕРИОДА(СлужебноеРасследование.Дата, ДЕНЬ) КАК Дата,
		|	Организации.ВалютаУчета КАК ВалютаУчета,
		|	Организации.ЮрФизЛицо КАК ЮрФизЛицо
		|ПОМЕСТИТЬ _СлужебныеРасследования
		|ИЗ
		|	Документ.СлужебноеРасследование КАК СлужебноеРасследование
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
		|		ПО СлужебноеРасследование.Организация = Организации.Ссылка
		|ГДЕ
		|	СлужебноеРасследование.Ссылка В(&Ссылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_СлужебныеРасследования.Ссылка КАК Ссылка,
		|	_СлужебныеРасследования.Дата КАК Дата,
		|	_СлужебныеРасследования.ВалютаУчета КАК ВалютаУчета,
		|	_СлужебныеРасследования.ЮрФизЛицо КАК ЮрФизЛицо,
		|	РеквизитыЮридическихЛиц.ПолноеНаименованиеПоУставу КАК ПолноеНаименованиеОрганизации,
		|	СлужебноеРасследование.Номер КАК Номер,
		|	СлужебноеРасследование.Проведен КАК Проведен,
		|	СлужебноеРасследование.Организация КАК Организация,
		|	СлужебноеРасследование.ДатаПолученияИнформации КАК ДатаПолученияИнформации,
		|	СлужебноеРасследование.ОбстоятельствоВозникновенияКонфликтаИнтересов КАК ОбстоятельствоВозникновенияКонфликтаИнтересов,
		|	СлужебноеРасследование.Банк КАК Банк,
		|	СлужебноеРасследование.ДатаЗаключенияДоговора КАК ДатаЗаключенияДоговора,
		|	СлужебноеРасследование.СрокДепозита КАК СрокДепозита,
		|	СлужебноеРасследование.ДатаСделки КАК ДатаСделки,
		|	СлужебноеРасследование.ВидСделки КАК ВидСделки,
		|	СлужебноеРасследование.Рынок КАК Рынок,
		|	СлужебноеРасследование.ЦеннаяБумага КАК ЦеннаяБумага,
		|	СлужебноеРасследование.СрокРЕПО КАК СрокРЕПО,
		|	СлужебноеРасследование.Статус КАК Статус,
		|	СлужебноеРасследование.Ответственный КАК Ответственный,
		|	СлужебноеРасследование.Комментарий КАК Комментарий,
		|	СлужебноеРасследование.УсловияВозникновенияКонфликтаУстановлены КАК УсловияВозникновенияКонфликтаУстановлены,
		|	СлужебноеРасследование.Обоснование КАК Обоснование,
		|	СлужебноеРасследование.ПринятыеМеры КАК ПринятыеМеры,
		|	СлужебноеРасследование.РуководительОрганизации КАК РуководительОрганизации,
		|	СлужебноеРасследование.УсловияВозниковенияКонфликта.(
		|		Ссылка КАК Ссылка,
		|		НомерСтроки КАК НомерСтроки,
		|		ОписаниеУсловий КАК ОписаниеУсловий
		|	) КАК УсловияВозниковенияКонфликта
		|ИЗ
		|	_СлужебныеРасследования КАК _СлужебныеРасследования
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			_СлужебныеРасследования.ЮрФизЛицо КАК ЮрФизЛицо,
		|			_СлужебныеРасследования.Дата КАК Дата,
		|			МАКСИМУМ(РеквизитыЮридическихЛиц.Период) КАК Период
		|		ИЗ
		|			_СлужебныеРасследования КАК _СлужебныеРасследования
		|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц КАК РеквизитыЮридическихЛиц
		|				ПО (РеквизитыЮридическихЛиц.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний))
		|					И (РеквизитыЮридическихЛиц.Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский))
		|					И _СлужебныеРасследования.ЮрФизЛицо = РеквизитыЮридическихЛиц.ЮрФизЛицо
		|					И _СлужебныеРасследования.Дата >= РеквизитыЮридическихЛиц.Период
		|		
		|		СГРУППИРОВАТЬ ПО
		|			_СлужебныеРасследования.ЮрФизЛицо,
		|			_СлужебныеРасследования.Дата) КАК ВложенныйЗапрос
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц КАК РеквизитыЮридическихЛиц
		|			ПО ВложенныйЗапрос.ЮрФизЛицо = РеквизитыЮридическихЛиц.ЮрФизЛицо
		|				И ВложенныйЗапрос.Период = РеквизитыЮридическихЛиц.Период
		|				И (РеквизитыЮридическихЛиц.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний))
		|				И (РеквизитыЮридическихЛиц.Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский))
		|		ПО _СлужебныеРасследования.ЮрФизЛицо = ВложенныйЗапрос.ЮрФизЛицо
		|			И _СлужебныеРасследования.Дата = ВложенныйЗапрос.Дата
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СлужебноеРасследование КАК СлужебноеРасследование
		|		ПО _СлужебныеРасследования.Ссылка = СлужебноеРасследование.Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	СлужебноеРасследование.МоментВремени";		
	#КонецОбласти 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	ПодготовитьДанныеПоТабличнымЧастям(Ссылка, Запрос);
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
	
		РеквизитыДокумента = Новый Структура;
		РеквизитыДокумента.Вставить("Проведен", Выборка.Проведен);
		РеквизитыДокумента.Вставить("Организация", Выборка.ПолноеНаименованиеОрганизации);
		РеквизитыДокумента.Вставить("ДатаПолученияИнформации", Формат(Выборка.ДатаПолученияИнформации, "ДФ=dd.MM.yyyy"));
		
		ЗаполнитьИнформациюПоТабличнымЧастям(РеквизитыДокумента, Выборка, Запрос);
		
		РеквизитыДокумента.Вставить("ИнформацияОСделке", ПолучитьИнформациюОСделке(Выборка));
		РеквизитыДокумента.Вставить("РезультатРасследования", Выборка.Статус);
		
		РеквизитыДокумента.Вставить("УсловияВозникновенияКонфликтаУстановлены", 
			Формат(Выборка.УсловияВозникновенияКонфликтаУстановлены, 
			"БЛ='Условия возникновения конфликта не установлены'; БИ='Условия возникновения конфликта установлены'"));
			
		Если Выборка.Статус = Перечисления.СтатусыСлужебныхРасследований.ВыявленКонфликтИнтересов Тогда
			
			РеквизитыДокумента.Вставить("Обоснование", " ");
			РеквизитыДокумента.Вставить("Причины", Выборка.Обоснование);
			РеквизитыДокумента.Вставить("ПринятыеМеры", Выборка.ПринятыеМеры);
		
		ИначеЕсли Выборка.Статус = Перечисления.СтатусыСлужебныхРасследований.КонфликтИнтересовНеВыявлен Тогда
			
			РеквизитыДокумента.Вставить("Обоснование", Выборка.Обоснование);
			РеквизитыДокумента.Вставить("Причины", "-");
			РеквизитыДокумента.Вставить("ПринятыеМеры", "-");
			
		КонецЕсли;
			
		РеквизитыДокумента.Вставить("ДатаПроведенияРасследования", Формат(Выборка.Дата, "ДФ=dd.MM.yyyy"));
		РеквизитыДокумента.Вставить("ДатаСоставленияОтчета", Формат(Выборка.Дата, "ДФ=dd.MM.yyyy"));
		
		ЗаполнитьРеквизитыПодписантов(РеквизитыДокумента, Выборка);
		
		МассивОтчетов.Добавить(Новый Структура("Ссылка, РеквизитыДокумента", Выборка.Ссылка, РеквизитыДокумента));
	
	КонецЦикла; 
	
	Возврат МассивОтчетов;
	
КонецФункции

Функция ПолучитьИнформациюОСделке(Выборка)

	ИсходнаяСтрока = ";%1 день; ;%1 дня;%1 дней;%1 дня";
	
	Если Выборка.ОбстоятельствоВозникновенияКонфликтаИнтересов = Справочники.ОбстоятельстваВозникновенияКонфликтаИнтересов.ДепозитныйВклад Тогда
	
		ИнформацияОСделке = "Информация о депозитном вкладе: " + Символ(13)
			+ " - " + Выборка.Банк + Символ(13) 
			+ " - " + Формат(Выборка.ДатаЗаключенияДоговора, "ДФ=dd.MM.yyyy") + Символ(13)
			+ " - " + СтрокаСЧислом(ИсходнаяСтрока, Выборка.СрокДепозита, ВидЧисловогоЗначения.Количественное);
			
	ИначеЕсли Выборка.ОбстоятельствоВозникновенияКонфликтаИнтересов = Справочники.ОбстоятельстваВозникновенияКонфликтаИнтересов.СовместноеВладение Тогда
		
		ИнформацияОСделке = "Совместное владение";	
		
	ИначеЕсли Выборка.ОбстоятельствоВозникновенияКонфликтаИнтересов = Справочники.ОбстоятельстваВозникновенияКонфликтаИнтересов.Сделка
		Или Выборка.ОбстоятельствоВозникновенияКонфликтаИнтересов = Справочники.ОбстоятельстваВозникновенияКонфликтаИнтересов.СделкаРЕПО Тогда 
		
		СрокРЕПО = СтрокаСЧислом(ИсходнаяСтрока, Выборка.СрокРЕПО, ВидЧисловогоЗначения.Количественное);
		
		ИнформацияОСделке = "Информация о сделке: " + Символ(13) 
			+ " - " + Формат(Выборка.ДатаСделки, "ДФ=dd.MM.yyyy") + Символ(13)
			+ " - " + Выборка.ВидСделки + ?(Выборка.СрокРЕПО = 0, "", " (РЕПО) " + СрокРЕПО) + Символ(13)
			+ " - " + РаботаСЦеннымиБумагамиКлиентСервер.ТипЦеннойБумагиВЗависимостиОтРынка(Выборка.Рынок) + " " + Выборка.ЦеннаяБумага;
			
	КонецЕсли; 
	
	Возврат ИнформацияОСделке;

КонецФункции
 
Процедура ЗаполнитьРеквизитыПодписантов(РеквизитыДокумента, Выборка)

	РеквизитыДокумента.Вставить("ДолжностьОтветственного", "Внутренний контролер");
	РеквизитыДокумента.Вставить("ФИООтветственного", Выборка.Ответственный);
	РеквизитыДокумента.Вставить("ДолжностьРуководителя", "Генеральный директор");
	РеквизитыДокумента.Вставить("ФИОРуководителя", Выборка.РуководительОрганизации);

КонецПроцедуры
 
Процедура ЗаполнитьИнформациюПоТабличнымЧастям(РеквизитыДокумента, Выборка, Запрос)

	Запрос.УстановитьПараметр("Расследование", Выборка.Ссылка);
	#Область ТекстЗапроса
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_РеквизитыКлиентов.ВидДоговораДоверительногоУправления КАК ВидДоговораДоверительногоУправления
		|ИЗ
		|	_РеквизитыКлиентов КАК _РеквизитыКлиентов
		|ГДЕ
		|	_РеквизитыКлиентов.Ссылка = &Расследование
		|	И _РеквизитыКлиентов.ВидСчета = ЗНАЧЕНИЕ(Перечисление.ВидыСвязейИсточниковСведенийПредоставляемыхЮрФизЛицами.Клиент)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВидДоговораДоверительногоУправления
		|АВТОУПОРЯДОЧИВАНИЕ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_РеквизитыКлиентов.ВидСчета КАК ВидСчета,
		|	_РеквизитыКлиентов.Наименование КАК Наименование
		|ИЗ
		|	_РеквизитыКлиентов КАК _РеквизитыКлиентов
		|ГДЕ
		|	_РеквизитыКлиентов.Ссылка = &Расследование
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВидСчета,
		|	Наименование
		|ИТОГИ ПО
		|	ВидСчета
		|АВТОУПОРЯДОЧИВАНИЕ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_ИнформацияПоЦеннымБумагам.Рынок КАК Рынок,
		|	_ИнформацияПоЦеннымБумагам.ЦеннаяБумага КАК ЦеннаяБумага
		|ИЗ
		|	_ИнформацияПоЦеннымБумагам КАК _ИнформацияПоЦеннымБумагам
		|ГДЕ
		|	_ИнформацияПоЦеннымБумагам.Ссылка = &Расследование
		|
		|УПОРЯДОЧИТЬ ПО
		|	_ИнформацияПоЦеннымБумагам.Рынок,
		|	_ИнформацияПоЦеннымБумагам.ЦеннаяБумага
		|ИТОГИ ПО
		|	Рынок
		|АВТОУПОРЯДОЧИВАНИЕ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(_РеквизитыКлиентов.Счет) = ТИП(Справочник.СчетаДоверительногоУправления)
		|			ТОГДА ""Первичные документы организации""
		|		ИНАЧЕ _РеквизитыКлиентов.Наименование
		|	КОНЕЦ КАК ИсточникИнформации
		|ИЗ
		|	_РеквизитыКлиентов КАК _РеквизитыКлиентов
		|ГДЕ
		|	_РеквизитыКлиентов.Ссылка = &Расследование";		
	#КонецОбласти 
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	СоответствиеВидовКодексов = Новый Соответствие;
	СоответствиеВидовКодексов.Вставить(
		Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиНакоплениями, 
		"кодекса профессиональной этики управляющей компании, осуществляющей деятельность, связанную с формированием и инвестированием средств пенсионных накоплений");
	СоответствиеВидовКодексов.Вставить(
		Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПФР, 
		"кодекса профессиональной этики управляющей компании, осуществляющей деятельность, связанную с формированием и инвестированием средств пенсионных накоплений");
	СоответствиеВидовКодексов.Вставить(
		Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиЖилищногоОбеспеченияВоеннослужащих, 
		"кодекса профессиональной этики управляющей компании, осуществляющей деятельность, связанную с формированием и инвестированием накоплений для жилищного обеспечения военнослужащих");
	
	ВидыКодексов = "";
	ВыборкаВидыКодексов = МассивРезультатов[0].Выбрать();
	Пока ВыборкаВидыКодексов.Следующий() Цикл
		ТекВидКодекса = СоответствиеВидовКодексов[ВыборкаВидыКодексов.ВидДоговораДоверительногоУправления];
		Если СтрНайти(ВидыКодексов, ТекВидКодекса) = 0 Тогда
			ВидыКодексов = ВидыКодексов + Символ(13) + ТекВидКодекса;
		КонецЕсли; 
	КонецЦикла;
	
	ВидыСчетов = Новый Соответствие;
	ВидыСчетов.Вставить(Перечисления.ВидыСвязейИсточниковСведенийПредоставляемыхЮрФизЛицами.АффилированноеЛицо, "Аффилированные лица");
	ВидыСчетов.Вставить(Перечисления.ВидыСвязейИсточниковСведенийПредоставляемыхЮрФизЛицами.ДолжностноеЛицо, "Должностные лица");
	ВидыСчетов.Вставить(Перечисления.ВидыСвязейИсточниковСведенийПредоставляемыхЮрФизЛицами.Сотрудник, "Сотрудники");
	ВидыСчетов.Вставить(Перечисления.ВидыСвязейИсточниковСведенийПредоставляемыхЮрФизЛицами.БлизкийРодственникДолжностногоЛица, "Близкие родственники должностных лиц");
	ВидыСчетов.Вставить(Перечисления.ВидыСвязейИсточниковСведенийПредоставляемыхЮрФизЛицами.БлизкийРодственникСотрудника, "Близкие родственники сотрудников");
	ВидыСчетов.Вставить(Перечисления.ВидыСвязейИсточниковСведенийПредоставляемыхЮрФизЛицами.Клиент, "Клиенты");
	ВидыСчетов.Вставить(Перечисления.ВидыСвязейИсточниковСведенийПредоставляемыхЮрФизЛицами.УправляющаяКомпания, "Управляющая компания");
	
	Клиенты = "";
	ВыборкаВидСчета = МассивРезультатов[1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаВидСчета.Следующий() Цикл
		
		ВыборкаКлиенты = ВыборкаВидСчета.Выбрать();
		Клиенты = Клиенты + Символ(13) + ВидыСчетов[ВыборкаВидСчета.ВидСчета] + ": ";
		КлиентыМассив = Новый Массив;
		
		Пока ВыборкаКлиенты.Следующий() Цикл
			КлиентыМассив.Добавить(ВыборкаКлиенты.Наименование);
		КонецЦикла;
		
		Клиенты = Клиенты + СтрСоединить(КлиентыМассив, ", ");
	
	КонецЦикла; 
	
	Если Не МассивРезультатов[1].Пустой() Тогда
		Клиенты = Сред(Клиенты, 2);
	КонецЕсли; 
	
	ЦенныеБумаги = "";
	ВыборкаРынок = МассивРезультатов[2].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаРынок.Следующий() Цикл
		
		ВыборкаЦенныеБумаги = ВыборкаРынок.Выбрать();
		ЦенныеБумаги = ЦенныеБумаги + Символ(13) + ВыборкаРынок.Рынок + ": " + Символ(13);
		ЦенныеБумагиМассив = Новый Массив;
		
		Пока ВыборкаЦенныеБумаги.Следующий() Цикл
			ЦенныеБумагиМассив.Добавить(ВыборкаЦенныеБумаги.ЦеннаяБумага);
		КонецЦикла;
		
		ЦенныеБумаги = ЦенныеБумаги + СтрСоединить(ЦенныеБумагиМассив, Символ(13));
	
	КонецЦикла;
	Если МассивРезультатов[1].Пустой() Тогда
		ЦенныеБумаги = Сред(ЦенныеБумаги, 2);
	КонецЕсли; 
	
	ИсточникиИнформации = "";
	ВыборкаИсточникиИнформации = МассивРезультатов[3].Выбрать();
	Пока ВыборкаИсточникиИнформации.Следующий() Цикл	
		ИсточникиИнформации = ИсточникиИнформации + Символ(13) + ВыборкаИсточникиИнформации.ИсточникИнформации;
	КонецЦикла;
	
	УсловияВозниковенияКонфликта = "";
	ВыборкаУсловий = Выборка.УсловияВозниковенияКонфликта.Выбрать();
	Пока ВыборкаУсловий.Следующий() Цикл
		УсловияВозниковенияКонфликта = УсловияВозниковенияКонфликта + Символ(13) + ВыборкаУсловий.ОписаниеУсловий;
	КонецЦикла; 
	
	РеквизитыДокумента.Вставить("ВидыКодексов", Сред(ВидыКодексов, 2));
	РеквизитыДокумента.Вставить("Клиенты", Клиенты + ЦенныеБумаги);
	РеквизитыДокумента.Вставить("ИсточникиИнформации", Сред(ИсточникиИнформации, 2));
	РеквизитыДокумента.Вставить("УсловияВозниковенияКонфликта", Сред(УсловияВозниковенияКонфликта, 2));

КонецПроцедуры
 
Функция ПолучитьИнформациюПоСделкам(Ссылка, МенеджерВременныхТаблиц = Неопределено) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	#Область ТекстЗапроса
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СлужебноеРасследованиеИнформацияОКонфликте.НомерСтроки КАК НомерСтроки,
		|	СлужебноеРасследованиеИнформацияОКонфликте.ПредметКонфликта КАК Документ,
		|	СлужебноеРасследованиеИнформацияОКонфликте.ВидСвязи КАК ВидСвязи,
		|	Организации.ВалютаУчета КАК ВалютаУчета,
		|	СлужебноеРасследование.ЦеннаяБумага КАК ЦеннаяБумага,
		|	СлужебноеРасследование.СрокРЕПО КАК СрокРЕПО,
		|	СлужебноеРасследование.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ _Сделки
		|ИЗ
		|	Документ.СлужебноеРасследование.ИнформацияОКонфликте КАК СлужебноеРасследованиеИнформацияОКонфликте
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СлужебноеРасследование КАК СлужебноеРасследование
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
		|			ПО СлужебноеРасследование.Организация = Организации.Ссылка
		|		ПО СлужебноеРасследованиеИнформацияОКонфликте.Ссылка = СлужебноеРасследование.Ссылка
		|ГДЕ
		|	СлужебноеРасследованиеИнформацияОКонфликте.Ссылка В(&Ссылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Сделки.НомерСтроки КАК НомерСтроки,
		|	ОперацииСЦеннымиБумагами.СчетДоверительногоУправления КАК Счет,
		|	_Сделки.Документ КАК Документ,
		|	ОперацииСЦеннымиБумагами.ДатаОперации КАК ВремяСделки,
		|	ОперацииСЦеннымиБумагами.Количество КАК Количество,
		|	ОперацииСЦеннымиБумагами.Цена КАК Цена,
		|	ОперацииСЦеннымиБумагами.Сумма КАК СуммаБезНКД,
		|	ОперацииСЦеннымиБумагами.СуммаКупона КАК НКД,
		|	СделкаРЕПО.СтавкаРЕПО КАК СтавкаРЕПО,
		|	ОперацииСЦеннымиБумагами.Валюта КАК Валюта,
		|	НАЧАЛОПЕРИОДА(ОперацииСЦеннымиБумагами.ДатаОперации, ДЕНЬ) КАК ДатаСделки,
		|	_Сделки.ВидСвязи КАК ВидСвязи,
		|	_Сделки.ВалютаУчета КАК ВалютаУчета,
		|	_Сделки.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ _ПараметрыСделок
		|ИЗ
		|	_Сделки КАК _Сделки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СделкаРЕПО КАК СделкаРЕПО
		|		ПО _Сделки.Документ = СделкаРЕПО.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОперацииСЦеннымиБумагами КАК ОперацииСЦеннымиБумагами
		|		ПО (СделкаРЕПО.Ссылка = ОперацииСЦеннымиБумагами.Операция)
		|			И (ОперацииСЦеннымиБумагами.ЦеннаяБумага = _Сделки.ЦеннаяБумага)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_Сделки.НомерСтроки,
		|	ОперацииСЦеннымиБумагами.СчетДоверительногоУправления,
		|	_Сделки.Документ,
		|	ОперацииСЦеннымиБумагами.ДатаОперации,
		|	ОперацииСЦеннымиБумагами.Количество,
		|	ОперацииСЦеннымиБумагами.Цена,
		|	ОперацииСЦеннымиБумагами.Сумма,
		|	ОперацииСЦеннымиБумагами.СуммаКупона,
		|	0,
		|	ОперацииСЦеннымиБумагами.Валюта,
		|	НАЧАЛОПЕРИОДА(ОперацииСЦеннымиБумагами.ДатаОперации, ДЕНЬ),
		|	_Сделки.ВидСвязи,
		|	_Сделки.ВалютаУчета,
		|	_Сделки.Ссылка
		|ИЗ
		|	_Сделки КАК _Сделки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка КАК Сделка
		|		ПО _Сделки.Документ = Сделка.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОперацииСЦеннымиБумагами КАК ОперацииСЦеннымиБумагами
		|		ПО (Сделка.Ссылка = ОперацииСЦеннымиБумагами.Операция)
		|			И (ОперацииСЦеннымиБумагами.ЦеннаяБумага = _Сделки.ЦеннаяБумага)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_Сделки.НомерСтроки,
		|	СведенияПредоставляемыеЮрФизЛицами.ИсточникСведений,
		|	_Сделки.Документ,
		|	СведенияПредоставляемыеЮрФизЛицамиСделки.ДатаСделки,
		|	СведенияПредоставляемыеЮрФизЛицамиСделки.Количество,
		|	СведенияПредоставляемыеЮрФизЛицамиСделки.Цена,
		|	СведенияПредоставляемыеЮрФизЛицамиСделки.СуммаБезНКД,
		|	СведенияПредоставляемыеЮрФизЛицамиСделки.НКД,
		|	СведенияПредоставляемыеЮрФизЛицамиСделки.СтавкаРЕПО,
		|	_Сделки.ВалютаУчета,
		|	НАЧАЛОПЕРИОДА(СведенияПредоставляемыеЮрФизЛицамиСделки.ДатаСделки, ДЕНЬ),
		|	_Сделки.ВидСвязи,
		|	_Сделки.ВалютаУчета,
		|	_Сделки.Ссылка
		|ИЗ
		|	_Сделки КАК _Сделки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СведенияПредоставляемыеЮрФизЛицами КАК СведенияПредоставляемыеЮрФизЛицами
		|		ПО _Сделки.Документ = СведенияПредоставляемыеЮрФизЛицами.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СведенияПредоставляемыеЮрФизЛицами.Сделки КАК СведенияПредоставляемыеЮрФизЛицамиСделки
		|		ПО (СведенияПредоставляемыеЮрФизЛицами.Ссылка = СведенияПредоставляемыеЮрФизЛицамиСделки.Ссылка)
		|			И (СведенияПредоставляемыеЮрФизЛицамиСделки.ЦеннаяБумага = _Сделки.ЦеннаяБумага)
		|			И (СведенияПредоставляемыеЮрФизЛицамиСделки.СрокРЕПО = _Сделки.СрокРЕПО)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ПараметрыСделок.Счет КАК Счет,
		|	_ПараметрыСделок.Документ КАК Документ,
		|	_ПараметрыСделок.ВремяСделки КАК ВремяСделки,
		|	_ПараметрыСделок.Количество КАК Количество,
		|	_ПараметрыСделок.Цена * КурсыВалютСделок.Курс / КурсыВалютСделок.Кратность / КурсыВалютыУчета.Курс * КурсыВалютыУчета.Кратность КАК Цена,
		|	_ПараметрыСделок.СуммаБезНКД * КурсыВалютСделок.Курс / КурсыВалютСделок.Кратность / КурсыВалютыУчета.Курс * КурсыВалютыУчета.Кратность КАК СуммаБезНКД,
		|	_ПараметрыСделок.НКД * КурсыВалютСделок.Курс / КурсыВалютСделок.Кратность / КурсыВалютыУчета.Курс * КурсыВалютыУчета.Кратность КАК НКД,
		|	_ПараметрыСделок.СтавкаРЕПО КАК СтавкаРЕПО,
		|	_ПараметрыСделок.ВидСвязи КАК ВидСчета,
		|	_ПараметрыСделок.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ _ИнформацияПоСделкам
		|ИЗ
		|	_ПараметрыСделок КАК _ПараметрыСделок
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалютСделок
		|		ПО _ПараметрыСделок.Валюта = КурсыВалютСделок.Валюта
		|			И _ПараметрыСделок.ДатаСделки = КурсыВалютСделок.Период
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалютыУчета
		|		ПО _ПараметрыСделок.ВалютаУчета = КурсыВалютыУчета.Валюта
		|			И _ПараметрыСделок.ДатаСделки = КурсыВалютыУчета.Период";		
	#КонецОбласти 
	
	Если МенеджерВременныхТаблиц = Неопределено Тогда
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПОМЕСТИТЬ _ИнформацияПоСделкам", ",_ПараметрыСделок.НомерСтроки");
		Запрос.Текст = Запрос.Текст + "
		|
		|УПОРЯДОЧИТЬ ПО
		|	_ПараметрыСделок.НомерСтроки";
		Возврат Запрос.Выполнить().Выгрузить();
		
	Иначе
		
		Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
		Запрос.Выполнить();
		Запрос.Текст = 
			"УНИЧТОЖИТЬ _Сделки
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ _ПараметрыСделок";
		Запрос.Выполнить();
		
	КонецЕсли; 

КонецФункции

Функция ПолучитьИнформациюПоДепозитнымВкладам(Ссылка, МенеджерВременныхТаблиц = Неопределено) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	#Область Текст_запроса
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СлужебноеРасследованиеИнформацияОКонфликте.НомерСтроки КАК НомерСтроки,
		|	СлужебноеРасследованиеИнформацияОКонфликте.ВидСвязи КАК ВидСчета,
		|	СлужебноеРасследованиеИнформацияОКонфликте.ПредметКонфликта КАК ДепозитныйВклад,
		|	ЕСТЬNULL(УсловияКредитныхИнструментовСрезПервых.Процент, 0) КАК ПроцентнаяСтавка,
		|	БанковскиеСчета.Договор КАК Договор,
		|	СлужебноеРасследование.Организация КАК Организация,
		|	СлужебноеРасследование.Ссылка КАК Ссылка,
		|	СлужебноеРасследование.ДатаЗаключенияДоговора КАК ДатаЗаключенияДоговора
		|ПОМЕСТИТЬ _ДепозитныеВклады
		|ИЗ
		|	Документ.СлужебноеРасследование.ИнформацияОКонфликте КАК СлужебноеРасследованиеИнформацияОКонфликте
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			УсловияКредитныхИнструментовСрезПервых.КредитныйИнструмент КАК КредитныйИнструмент,
		|			УсловияКредитныхИнструментовСрезПервых.Процент КАК Процент
		|		ИЗ
		|			(ВЫБРАТЬ
		|				УсловияКредитныхИнструментовСрезПервых.КредитныйИнструмент КАК КредитныйИнструмент,
		|				МИНИМУМ(УсловияКредитныхИнструментовСрезПервых.ДатаНачалаДействияУсловий) КАК ДатаНачалаДействияУсловий
		|			ИЗ
		|				РегистрСведений.УсловияКредитныхИнструментов.СрезПервых(
		|						,
		|						КредитныйИнструмент В
		|							(ВЫБРАТЬ
		|								СлужебноеРасследованиеИнформацияОКонфликте.ПредметКонфликта КАК ДепозитныйВклад
		|							ИЗ
		|								Документ.СлужебноеРасследование.ИнформацияОКонфликте КАК СлужебноеРасследованиеИнформацияОКонфликте
		|							ГДЕ
		|								СлужебноеРасследованиеИнформацияОКонфликте.Ссылка В (&Ссылка))) КАК УсловияКредитныхИнструментовСрезПервых
		|			ГДЕ
		|				УсловияКредитныхИнструментовСрезПервых.Действует
		|			
		|			СГРУППИРОВАТЬ ПО
		|				УсловияКредитныхИнструментовСрезПервых.КредитныйИнструмент) КАК АктуальныеДатыНачалаДействия
		|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияКредитныхИнструментов.СрезПервых(
		|						,
		|						КредитныйИнструмент В
		|							(ВЫБРАТЬ
		|								СлужебноеРасследованиеИнформацияОКонфликте.ПредметКонфликта КАК ДепозитныйВклад
		|							ИЗ
		|								Документ.СлужебноеРасследование.ИнформацияОКонфликте КАК СлужебноеРасследованиеИнформацияОКонфликте
		|							ГДЕ
		|								СлужебноеРасследованиеИнформацияОКонфликте.Ссылка В (&Ссылка))) КАК УсловияКредитныхИнструментовСрезПервых
		|				ПО АктуальныеДатыНачалаДействия.КредитныйИнструмент = УсловияКредитныхИнструментовСрезПервых.КредитныйИнструмент
		|					И АктуальныеДатыНачалаДействия.ДатаНачалаДействияУсловий = УсловияКредитныхИнструментовСрезПервых.ДатаНачалаДействияУсловий) КАК УсловияКредитныхИнструментовСрезПервых
		|		ПО СлужебноеРасследованиеИнформацияОКонфликте.ПредметКонфликта = УсловияКредитныхИнструментовСрезПервых.КредитныйИнструмент
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДепозитныеВклады КАК ДепозитныеВклады
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.БанковскиеСчета КАК БанковскиеСчета
		|			ПО ДепозитныеВклады.БанковскийСчет = БанковскиеСчета.Ссылка
		|		ПО СлужебноеРасследованиеИнформацияОКонфликте.ПредметКонфликта = ДепозитныеВклады.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СлужебноеРасследование КАК СлужебноеРасследование
		|		ПО СлужебноеРасследованиеИнформацияОКонфликте.Ссылка = СлужебноеРасследование.Ссылка
		|ГДЕ
		|	СлужебноеРасследованиеИнформацияОКонфликте.Ссылка В(&Ссылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ДепозитныеВклады.НомерСтроки КАК НомерСтроки,
		|	_ДепозитныеВклады.ВидСчета КАК ВидСчета,
		|	_ДепозитныеВклады.ДепозитныйВклад КАК ДепозитныйВклад,
		|	_ДепозитныеВклады.ПроцентнаяСтавка КАК ПроцентнаяСтавка,
		|	ДоговорыСчетовДоверительногоУправления.СчетДоверительногоУправления КАК Счет,
		|	_ДепозитныеВклады.Ссылка КАК Ссылка,
		|	_ДепозитныеВклады.ДатаЗаключенияДоговора КАК ДатаЗаключенияДоговора
		|ПОМЕСТИТЬ _ИнформацияПоДепозитнымВкладам
		|ИЗ
		|	_ДепозитныеВклады КАК _ДепозитныеВклады
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			_ДепозитныеВклады.Договор КАК Договор,
		|			МАКСИМУМ(ДоговорыСчетовДоверительногоУправления.Период) КАК Период,
		|			_ДепозитныеВклады.Организация КАК Организация
		|		ИЗ
		|			_ДепозитныеВклады КАК _ДепозитныеВклады
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДоговорыСчетовДоверительногоУправления КАК ДоговорыСчетовДоверительногоУправления
		|				ПО _ДепозитныеВклады.Договор = ДоговорыСчетовДоверительногоУправления.Договор
		|					И (ДоговорыСчетовДоверительногоУправления.Активный)
		|					И (ДоговорыСчетовДоверительногоУправления.Организация = _ДепозитныеВклады.Организация)
		|		
		|		СГРУППИРОВАТЬ ПО
		|			_ДепозитныеВклады.Договор,
		|			_ДепозитныеВклады.Организация) КАК ВложенныйЗапрос
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДоговорыСчетовДоверительногоУправления КАК ДоговорыСчетовДоверительногоУправления
		|			ПО ВложенныйЗапрос.Договор = ДоговорыСчетовДоверительногоУправления.Договор
		|				И ВложенныйЗапрос.Организация = ДоговорыСчетовДоверительногоУправления.Организация
		|				И (ДоговорыСчетовДоверительногоУправления.Активный)
		|		ПО _ДепозитныеВклады.Договор = ВложенныйЗапрос.Договор";		
	#КонецОбласти 
	
	Если МенеджерВременныхТаблиц = Неопределено Тогда
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПОМЕСТИТЬ _ИнформацияПоДепозитнымВкладам", "");
		Запрос.Текст = Запрос.Текст + "
		|
		|УПОРЯДОЧИТЬ ПО
		|	_ДепозитныеВклады.НомерСтроки";
		Возврат Запрос.Выполнить().Выгрузить();
		
	Иначе
		
		Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
		Запрос.Выполнить();
		Запрос.Текст = 
			"УНИЧТОЖИТЬ _ДепозитныеВклады";
		Запрос.Выполнить();
		
	КонецЕсли;
	
КонецФункции

Функция ПолучитьИнформациюПоЦеннымБумагам(Ссылка, МенеджерВременныхТаблиц = Неопределено) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Биржа", ОбщегоНазначения.ПолучитьИменованныйОбъект("Биржа_ММВБ"));
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	СлужебноеРасследованиеЦенныеБумаги.Ссылка КАК Ссылка,
		|	СлужебноеРасследованиеЦенныеБумаги.НомерСтроки КАК НомерСтроки,
		|	СлужебноеРасследованиеЦенныеБумаги.Счет КАК Счет,
		|	СлужебноеРасследованиеЦенныеБумаги.ВидСвязи КАК ВидСвязи,
		|	СлужебноеРасследованиеЦенныеБумаги.Рынок КАК Рынок,
		|	СлужебноеРасследованиеЦенныеБумаги.ЦеннаяБумага КАК ЦеннаяБумага,
		|	СлужебноеРасследованиеЦенныеБумаги.Количество КАК Количество,
		|	ЕСТЬNULL(КотировкиТорговыхПлощадок.LISTNAME, 0) КАК УровеньЛистинга,
		|	СлужебноеРасследование.ДатаСделки КАК ДатаСделки
		|ПОМЕСТИТЬ _ИнформацияПоЦеннымБумагам
		|ИЗ
		|	Документ.СлужебноеРасследование.ЦенныеБумаги КАК СлужебноеРасследованиеЦенныеБумаги
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СлужебноеРасследование КАК СлужебноеРасследование
		|		ПО СлужебноеРасследованиеЦенныеБумаги.Ссылка = СлужебноеРасследование.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КотировкиТорговыхПлощадок КАК КотировкиТорговыхПлощадок
		|		ПО (КотировкиТорговыхПлощадок.Биржа = &Биржа)
		|			И СлужебноеРасследованиеЦенныеБумаги.Рынок = КотировкиТорговыхПлощадок.Рынок
		|			И СлужебноеРасследованиеЦенныеБумаги.ЦеннаяБумага = КотировкиТорговыхПлощадок.ЦеннаяБумага
		|			И (КотировкиТорговыхПлощадок.Период = СлужебноеРасследование.ДатаСделки)
		|			И (КотировкиТорговыхПлощадок.РежимТоргов.ОсновнойРежим)
		|ГДЕ
		|	СлужебноеРасследованиеЦенныеБумаги.Ссылка В(&Ссылка)";
	
	Если МенеджерВременныхТаблиц = Неопределено Тогда
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПОМЕСТИТЬ _ИнформацияПоЦеннымБумагам", "");
		Запрос.Текст = Запрос.Текст + "
		|
		|УПОРЯДОЧИТЬ ПО
		|	СлужебноеРасследованиеЦенныеБумаги.НомерСтроки";
		Возврат Запрос.Выполнить().Выгрузить();
		
	Иначе
		
		Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
		Запрос.Выполнить();
		
	КонецЕсли;

КонецФункции
 
Процедура ПодготовитьДанныеПоТабличнымЧастям(Ссылка, Запрос)

	ПолучитьИнформациюПоДепозитнымВкладам(Ссылка, 	Запрос.МенеджерВременныхТаблиц);
	ПолучитьИнформациюПоСделкам(Ссылка, 			Запрос.МенеджерВременныхТаблиц);
	ПолучитьИнформациюПоЦеннымБумагам(Ссылка, 		Запрос.МенеджерВременныхТаблиц);
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ИнформацияПоСделкам.Счет КАК Счет,
		|	_ИнформацияПоСделкам.ВидСчета КАК ВидСчета,
		|	НАЧАЛОПЕРИОДА(_ИнформацияПоСделкам.ВремяСделки, ДЕНЬ) КАК ДатаСделки,
		|	_ИнформацияПоСделкам.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ _ИнформацияОКлиентах
		|ИЗ
		|	_ИнформацияПоСделкам КАК _ИнформацияПоСделкам
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	_ИнформацияПоДепозитнымВкладам.Счет,
		|	_ИнформацияПоДепозитнымВкладам.ВидСчета,
		|	НАЧАЛОПЕРИОДА(_ИнформацияПоДепозитнымВкладам.ДатаЗаключенияДоговора, ДЕНЬ),
		|	_ИнформацияПоДепозитнымВкладам.Ссылка
		|ИЗ
		|	_ИнформацияПоДепозитнымВкладам КАК _ИнформацияПоДепозитнымВкладам
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	_ИнформацияПоЦеннымБумагам.Счет,
		|	_ИнформацияПоЦеннымБумагам.ВидСвязи,
		|	_ИнформацияПоЦеннымБумагам.ДатаСделки,
		|	_ИнформацияПоЦеннымБумагам.Ссылка
		|ИЗ
		|	_ИнформацияПоЦеннымБумагам КАК _ИнформацияПоЦеннымБумагам
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_ИнформацияОКлиентах.Ссылка КАК Ссылка,
		|	_ИнформацияОКлиентах.ВидСчета КАК ВидСчета,
		|	_ИнформацияОКлиентах.Счет КАК Счет,
		|	_ИнформацияОКлиентах.ДатаСделки КАК ДатаСделки,
		|	ЕСТЬNULL(КлиентыДоверительногоУправления.Клиент, ИсточникиСведенийПредоставляемыхЮрФизЛицами.ЮрФизЛицо) КАК Клиент,
		|	СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления КАК ВидДоговораДоверительногоУправления
		|ПОМЕСТИТЬ _КлиентыДоверительногоУправления
		|ИЗ
		|	_ИнформацияОКлиентах КАК _ИнформацияОКлиентах
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			_ИнформацияОКлиентах.Счет КАК Счет,
		|			МАКСИМУМ(КлиентыДоверительногоУправления.Период) КАК Период,
		|			_ИнформацияОКлиентах.ДатаСделки КАК ДатаСделки
		|		ИЗ
		|			_ИнформацияОКлиентах КАК _ИнформацияОКлиентах
		|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления КАК КлиентыДоверительногоУправления
		|				ПО _ИнформацияОКлиентах.Счет = КлиентыДоверительногоУправления.СчетДоверительногоУправления
		|					И _ИнформацияОКлиентах.ДатаСделки >= КлиентыДоверительногоУправления.Период
		|		
		|		СГРУППИРОВАТЬ ПО
		|			_ИнформацияОКлиентах.Счет,
		|			_ИнформацияОКлиентах.ДатаСделки) КАК ВложенныйЗапрос
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления КАК КлиентыДоверительногоУправления
		|			ПО ВложенныйЗапрос.Счет = КлиентыДоверительногоУправления.СчетДоверительногоУправления
		|				И ВложенныйЗапрос.Период = КлиентыДоверительногоУправления.Период
		|		ПО _ИнформацияОКлиентах.ДатаСделки = ВложенныйЗапрос.ДатаСделки
		|			И _ИнформацияОКлиентах.Счет = ВложенныйЗапрос.Счет
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИсточникиСведенийПредоставляемыхЮрФизЛицами КАК ИсточникиСведенийПредоставляемыхЮрФизЛицами
		|		ПО _ИнформацияОКлиентах.Счет = ИсточникиСведенийПредоставляемыхЮрФизЛицами.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
		|		ПО _ИнформацияОКлиентах.Счет = СчетаДоверительногоУправления.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_КлиентыДоверительногоУправления.Ссылка КАК Ссылка,
		|	_КлиентыДоверительногоУправления.ВидСчета КАК ВидСчета,
		|	_КлиентыДоверительногоУправления.Счет КАК Счет,
		|	_КлиентыДоверительногоУправления.ДатаСделки КАК ДатаСделки,
		|	_КлиентыДоверительногоУправления.Клиент КАК Клиент,
		|	ВЫБОР
		|		КОГДА РеквизитыФизическихЛицАнкетные.ЮрФизЛицо ЕСТЬ НЕ NULL 
		|			ТОГДА РеквизитыФизическихЛицАнкетные.Фамилия + "" "" + РеквизитыФизическихЛицАнкетные.Имя + "" "" + РеквизитыФизическихЛицАнкетные.Отчество
		|		ИНАЧЕ РеквизитыЮридическихЛицАнкетные.КраткоеНаименованиеПоУставу
		|	КОНЕЦ КАК Наименование,
		|	_КлиентыДоверительногоУправления.ВидДоговораДоверительногоУправления КАК ВидДоговораДоверительногоУправления
		|ПОМЕСТИТЬ _РеквизитыКлиентов
		|ИЗ
		|	_КлиентыДоверительногоУправления КАК _КлиентыДоверительногоУправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			_КлиентыДоверительногоУправления.Клиент КАК Клиент,
		|			_КлиентыДоверительногоУправления.ДатаСделки КАК ДатаСделки,
		|			ЕСТЬNULL(МАКСИМУМ(РеквизитыЮридическихЛицАнкетные.Период), МАКСИМУМ(РеквизитыФизическихЛицАнкетные.Период)) КАК ПериодРеквизитов
		|		ИЗ
		|			_КлиентыДоверительногоУправления КАК _КлиентыДоверительногоУправления
		|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛицАнкетные КАК РеквизитыЮридическихЛицАнкетные
		|				ПО _КлиентыДоверительногоУправления.Клиент = РеквизитыЮридическихЛицАнкетные.ЮрФизЛицо
		|					И (РеквизитыЮридическихЛицАнкетные.Организация = &Организация)
		|					И (РеквизитыЮридическихЛицАнкетные.Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский))
		|					И _КлиентыДоверительногоУправления.ДатаСделки >= РеквизитыЮридическихЛицАнкетные.Период
		|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыФизическихЛицАнкетные КАК РеквизитыФизическихЛицАнкетные
		|				ПО _КлиентыДоверительногоУправления.Клиент = РеквизитыФизическихЛицАнкетные.ЮрФизЛицо
		|					И (РеквизитыФизическихЛицАнкетные.Организация = &Организация)
		|					И (РеквизитыФизическихЛицАнкетные.Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский))
		|					И _КлиентыДоверительногоУправления.ДатаСделки >= РеквизитыФизическихЛицАнкетные.Период
		|		
		|		СГРУППИРОВАТЬ ПО
		|			_КлиентыДоверительногоУправления.Клиент,
		|			_КлиентыДоверительногоУправления.ДатаСделки) КАК ВложенныйЗапрос
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛицАнкетные КАК РеквизитыЮридическихЛицАнкетные
		|			ПО ВложенныйЗапрос.Клиент = РеквизитыЮридическихЛицАнкетные.ЮрФизЛицо
		|				И (РеквизитыЮридическихЛицАнкетные.Организация = &Организация)
		|				И (РеквизитыЮридическихЛицАнкетные.Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский))
		|				И ВложенныйЗапрос.ПериодРеквизитов = РеквизитыЮридическихЛицАнкетные.Период
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыФизическихЛицАнкетные КАК РеквизитыФизическихЛицАнкетные
		|			ПО ВложенныйЗапрос.Клиент = РеквизитыФизическихЛицАнкетные.ЮрФизЛицо
		|				И (РеквизитыФизическихЛицАнкетные.Организация = &Организация)
		|				И (РеквизитыФизическихЛицАнкетные.Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский))
		|				И ВложенныйЗапрос.ПериодРеквизитов = РеквизитыФизическихЛицАнкетные.Период
		|		ПО _КлиентыДоверительногоУправления.Клиент = ВложенныйЗапрос.Клиент
		|			И _КлиентыДоверительногоУправления.ДатаСделки = ВложенныйЗапрос.ДатаСделки";
	
	Запрос.УстановитьПараметр("Организация", Ссылка[0].Организация);
	
	Запрос.Выполнить();
	
	Запрос.Текст = 
		"УНИЧТОЖИТЬ _ИнформацияПоСделкам
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _ИнформацияПоДепозитнымВкладам
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _ИнформацияОКлиентах
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ _КлиентыДоверительногоУправления";
	
	Запрос.Выполнить();

КонецПроцедуры
